In [1]:
import numpy as np
import pandas as pd

In [9]:
d_one = {'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']}
d_two = {'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']}
df_one = pd.DataFrame(d_one)
df_two = pd.DataFrame(d_two)
df_one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [10]:
df_two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

#### Concatenation along rows

In [11]:
axis0 = pd.concat([df_one,df_two],axis=0)
axis0

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

#### Concatenation along columns

In [12]:
axis1 = pd.concat([df_one,df_two],axis=1)
axis1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

#### Merge

In [13]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Akash','Bharat','Chetan','Deepak']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Akash','Yamuna','Bharat']})

In [14]:
registrations

   reg_id    name
0       1   Akash
1       2  Bharat
2       3  Chetan
3       4  Deepak

In [15]:
logins

   log_id    name
0       1  Xavier
1       2   Akash
2       3  Yamuna
3       4  Bharat

In [19]:
pd.merge(registrations,logins,how='inner',on='name')

   reg_id    name  log_id
0       1   Akash       2
1       2  Bharat       4

#### Inner

In [21]:
pd.merge(registrations,logins,how='inner')

   reg_id    name  log_id
0       1   Akash       2
1       2  Bharat       4

#### Left

In [22]:
pd.merge(registrations,logins, how = 'left')

   reg_id    name  log_id
0       1   Akash     2.0
1       2  Bharat     4.0
2       3  Chetan     NaN
3       4  Deepak     NaN

#### Right

In [23]:
pd.merge(registrations,logins, how = 'right')

   reg_id    name  log_id
0     NaN  Xavier       1
1     1.0   Akash       2
2     NaN  Yamuna       3
3     2.0  Bharat       4

#### Outer

In [24]:
pd.merge(registrations,logins, how = 'outer')

   reg_id    name  log_id
0     1.0   Akash     2.0
1     2.0  Bharat     4.0
2     3.0  Chetan     NaN
3     4.0  Deepak     NaN
4     NaN  Xavier     1.0
5     NaN  Yamuna     3.0

#### Join on Index

In [25]:
registrations1 = registrations.set_index('name')
registrations1

        reg_id
name
Akash        1
Bharat       2
Chetan       3
Deepak       4

In [26]:
pd.merge(registrations1,logins,left_index=True,right_on='name')

   reg_id  log_id    name
1       1       2   Akash
3       2       4  Bharat

In [27]:
pd.merge(logins,registrations1,right_index=True,left_on='name')

   log_id    name  reg_id
1       2   Akash       1
3       4  Bharat       2

In [28]:
registrations

   reg_id    name
0       1   Akash
1       2  Bharat
2       3  Chetan
3       4  Deepak

In [30]:
registrations.columns = ['reg_id','reg_name']
registrations

   reg_id reg_name
0       1    Akash
1       2   Bharat
2       3   Chetan
3       4   Deepak

In [32]:
#pd.merge(registrations,logins)  This is going to throw an error

In [34]:
pd.merge(registrations,logins, left_on='reg_name',right_on='name').drop('reg_name',axis=1)

   reg_id  log_id    name
0       1       2   Akash
1       2       4  Bharat

#### Pandas tags duplicate columns

In [36]:
registrations.columns = ['id','name']
registrations

   id    name
0   1   Akash
1   2  Bharat
2   3  Chetan
3   4  Deepak

In [37]:
logins.columns = ['id','name']
logins

   id    name
0   1  Xavier
1   2   Akash
2   3  Yamuna
3   4  Bharat

In [39]:
pd.merge(registrations,logins,on='name')

   id_x    name  id_y
0     1   Akash     2
1     2  Bharat     4

In [40]:
pd.merge(registrations,logins,on='name',suffixes=('_reg','_log'))

   id_reg    name  id_log
0       1   Akash       2
1       2  Bharat       4